backend/controllers/UserController.php

SELECT `id`, `family`, `name`, `patronymic`, `enddate` FROM `user`
---
    public function actionIndex()
    {
        $users = User::find()->select(['id', 'family', 'name', 'patronymic', 'enddate'])->all();