backend/modules/admin/controllers/DefaultController.php

    public function actionEdit($id)
    {

        $model = User::find()->where(['id' => $id])->one();

        if ($model->load(Yii::$app->request->post()) && $model->save(false)) {
---
SELECT * FROM `user`