backend/modules/admin/controllers/DefaultController.php

SELECT * FROM `user`
---
    public function actionGet()
    {
        $users = User::find()->all();

SELECT * FROM `user` WHERE `id`='4'
---
    public function actionEdit($id)
    {
        $model2 = User::find()->where(['id' => $id])->one();
        $model = new EditForm();
        if ($model->load(Yii::$app->request->post())) {
            $post = Yii::$app->request->post();

            $user_post = $post["EditForm"];
            $user = User::find()->where(['id' => $id])->one();